export enum ContentTypeEnum {
  // json
  JSON = 'application/json;charset=UTF-8',
  // form-data qs
  FORM_URLENCODED = 'application/x-www-form-urlencoded;charset=UTF-8',
  // form-data  upload
  FORM_DATA = 'multipart/form-data;charset=UTF-8',
}

export enum OptionsEnum {
  // timeout 超时
  timeout = 10000,
  withCredentials = 1
}

export enum CodeEnum {
  SUCCESS = 0,
  SERVER_ERROR = 500,
  NO_AUTH = 401,
  ACCESS_DENIED = 403,
  NO_PAGE = 404
}

// -1=请求失败
// 0=SUCCESS
// 500=服务器内部异常
// 401=未授权
// 403=拒绝访问，没有权限
// 404=请求路径不存在
// 10001={0}不能为空
// 10002=数据库中已存在该记录
// 10003=获取参数失败
// 10004=账号或密码错误
// 10005=账号已被停用
// 10006=唯一标识不能为空
// 10007=验证码不正确
// 10008=先删除子菜单或按钮
// 10009=原密码不正确
// 10010=账号不存在
// 10011=上级部门选择错误
// 10012=上级菜单不能为自身
// 10013=数据权限接口，只能是Map类型参数
// 10014=请先删除下级部门
// 10015=请先删除部门下的用户
// 10016=参数格式不正确，请使用JSON格式
// 10017=上级区域选择错误
// 10018=请先删除下级区域
// 46601=视频信息不存在
// 46602=该素材已被使用，无法删除
// 42001=升级更新
// 42002=报警
// 42003=通知消息
// 42004=账号其他设备登录
// 41001=缺少手机号码参数
// 41002=缺少登录密码参数
// 41003=缺少短信类型
// 43051=微信支付签名生成失败
// 41004=缺少短信模板
// 43052=微信支付订单关闭失败
// 41005=手机号不能为空
// 43053=微信支付退款申请失败
// 45101=住户已有绑定用户，无法置空手机号码
// 41006=手机号格式不正确
// 45102=手机号码不能为空
// 41007=短信发送失败
// 45103=楼栋已绑定管家
// 41008=短信发送数量超出每日最大限制
// 41009=缺少短信验证码参数
// 45105=家庭信息丢失
// 41010=频率过高，请稍后再试
